{
    "auth": {
      "welcome": "Мамандыққа бағыттау орталығына қош келдің!",
      "name": "Сенің атың кім?",
      "age": "Жасың нешеде?",
      "start": "Саяхатты бастау"
    },
    "result": {
      "congratulations": "Құттықтаймыз, {{name}}!",
      "yourProfession": "Сенің мамандығың",
      "download": "Нәтижені сақтау",
      "share": "Бөлісу",
      "startOver": "Қайта өту"
    },
    "home": {
      "hello": "Сәлем, {{name}}!",
      "startTest": "Тесті бастау",
      "viewResults": "Нәтижелерді көру"
    },
    "test": {
      "question": "Сұрақ {{current}} / {{total}}",
      "next": "Әрі қарай",
      "previous": "Артқа",
      "finish": "Тесті аяқтау"
    },
    "profession": {
      "SceneEndArtist": "Суретші",
      "SceneEndDesigner": "Дизайнер",
      "SceneEndWriter": "Жазушы",
      "SceneEndMusician": "Музыкант",
      "SceneEndPhotographer": "Фотограф",
      
      "SceneEndProgrammer": "Бағдарламашы",
      "SceneEndDataScientist": "Деректер бойынша маман",
      "SceneEndWebDeveloper": "Web-әзірлеуші",
      "SceneEndNetworkEngineer": "Желі инженері",
      "SceneEndGameDeveloper": "Ойын әзірлеуші",
      
      "SceneEndTeacher": "Мұғалім",
      "SceneEndPsychologist": "Психолог",
      "SceneEndHRManager": "HR-менеджер",
      "SceneEndJournalist": "Журналист",
      "SceneEndCounselor": "Кеңесші",
      
      "SceneEndAccountant": "Бухгалтер",
      "SceneEndEconomist": "Экономист",
      "SceneEndResearcher": "Зерттеуші",
      "SceneEndMathematician": "Математик",
      "SceneEndFinancialAnalyst": "Қаржы талдаушысы"
    },
    "scenes": {
      "sceneEntrance_description": "Сен Мамандыққа бағыттау орталығының жарық фойесіне кіресің. Студенттер абыр-сабыр, ал кеңесші Айдос сені байқап, жымиып қарайды.",
      "sceneEntrance_dialog": "Айдос: «Қош келдің! Мүмкіндігіңді анықтауға дайынсың ба? Онда кішігірім сауалнамадан өтейік!»",
      "sceneEntrance_choiceStart": "Тесті бастау",
  
      "sceneQ1_description": "Сен бірінші бөлімге кіріп, әртүрлі шығармашылық заттар мен техника қойылғанын көресің. Жаныңда Гүлмира есімді шеберлік сабағының жетекшісі тұр.",
      "sceneQ1_dialog": "Гүлмира: «Бос уақытыңды қалай өткізгенді ұнатасың? Қай салада өзіңді еркін сезінесің?»",
      "sceneQ1_choiceCreative": "Сурет салуды, музыка шығарып немесе басқа да шығармашылық істерді жақсы көремін",
      "sceneQ1_choiceTech": "Техника, гаджеттер, не код жазу салаларын ұнатамын",
      "sceneQ1_choiceSocial": "Адамдармен араласып, оларға көмектескенді және қауымдастықтың ортасында болғанды жақсы көремін",
  
      "sceneQ2_description": "Келесі бөлім салмақтылау. Қабырғаларда ғылыми постерлер мен студенттік жобалар ілулі. Сені Мирас қарсы алады.",
      "sceneQ2_dialog": "Мирас: «Саған бір тапсырма берілді деп елестет. Шешімді қалай іздейсің?»",
      "sceneQ2_choiceCreative": "Алдымен шабыт іздеп, стандарттан тыс қадам жасауым мүмкін",
      "sceneQ2_choiceTech": "Жұмыс жоспарын құрып, технологиялар немесе бағдарламалау жолдарын қолданамын",
      "sceneQ2_choiceAnalytical": "Деректерді жүйелеп, талдау жасап, гипотезаларды тексеремін",
  
      "sceneQ3_description": "Енді сен дәлізбен өтіп барасың. Мұнда студенттер топ-топ болып жиналған. Саған еріктілердің үйлестірушісі Сания жақындайды.",
      "sceneQ3_dialog": "Сания: «Біз қызықты қоғамдық жоба жасай аламыз. Алғашқы ойың қандай?»",
      "sceneQ3_choiceTech": "Координация үшін мобильді қосымша немесе сайт жасағым келеді",
      "sceneQ3_choiceSocial": "Адамдарды жинап, талқылау өткізіп, рөлдерді бөліп берер едім",
      "sceneQ3_choiceAnalytical": "Ресурстар мен тәуекелдерді саралап, бюджетке есеп жүргізер едім",
  
      "sceneQ4_description": "Келесі бөлме студияға ұқсайды. Музыка ойнап, айналада мольберттер мен арт-объектілер бар. Сені Жанар қарсы алады.",
      "sceneQ4_dialog": "Жанар: «Жаңа фестивальдің тұжырымдамасын ойлап табу керек. Сен не істейсің?»",
      "sceneQ4_choiceCreative": "Көз алдыма жарқын бейнелер елестетіп, визуалды тақырыпты дамыта бастаймын",
      "sceneQ4_choiceTech": "Онлайн-платформа мен техникалық қамтамасыз етуді ұйымдастырамын",
      "sceneQ4_choiceSocial": "Барлығымен хабарласып, фестивальға демеушілер мен серіктестер табамын",
  
      "sceneQ5_description": "Бұдан соң сен зертханаға кіресің. Монитор экранында графиктер мен формулалар толып тұр. Жетекші Алихан жұмысты бақылап отыр.",
      "sceneQ5_dialog": "Алихан: «Бізде эксперименттік деректер бар, бірақ тез арада қорытынды жасау қажет. Не істейсің?»",
      "sceneQ5_choiceSocial": "Әріптестерімді шақырып, нәтижелерді бірге талқылаймын",
      "sceneQ5_choiceAnalytical": "Деректерді өзім есептеп, есеп жасаймын және дұрыстығын тексеремін",
      "sceneQ5_choiceCreative": "Деректерді визуализациялаудың және түсіндірудің шығармашылық жолын ұсынамын",
  
      "sceneQ6_description": "Содан соң сен IT-зертханаға барасың. Нұрбол есімді техник саған жаңа платформаны көрсетуді күтуде.",
      "sceneQ6_dialog": "Нұрбол: «Бірегей нәрсе жасауға болады, бірақ сенің көзқарасың керек. Не істемексің?»",
      "sceneQ6_choiceTech": "Бағдарламалауға кірісіп, прототип жасап шығарамын",
      "sceneQ6_choiceSocial": "Сарапшылар мен пайдаланушыларды жұмылдырып, ынтымақтастықты жолға қоямын",
      "sceneQ6_choiceAnalytical": "Талаптарды жинап, сипаттамаларды мұқият зерттеп, мүмкіндіктерді есептеймін",
  
      "sceneQ7_description": "Соңғы бөлімде сені Гаухар есімді куратор күтіп отыр. Ол сенің қызығушылықтарың бойынша жиналған мәліметті қорытындылай бастады.",
      "sceneQ7_dialog": "Гаухар: «Бізге сенің негізгі артықшылықтарыңды анықтау үшін бір ғана сұрақ қалды. Командалық жұмыста қай тәсіл саған жақынырақ?»",
      "sceneQ7_choiceCreative": "Идеялармен шабыттандырып, жаңа тұжырымдамалар ұсыну",
      "sceneQ7_choiceTech": "Техникалық бөлігін жасап, процестерді автоматтандыру",
      "sceneQ7_choiceAnalytical": "Мәліметтерді зерттеп, талдап, кезең-кезеңімен жоспарлау",
  
      "sceneEndArtist_description": "Сен өнер әлеміне аяқ бастың, мұнда Қазақстандағы көрмелер мен галереялар саны жылына 10–15% өсіп келеді, ал онлайн платформалар шығармашылығыңды жаңа белестерге көтереді.",
      "sceneEndArtist_dialog": "Құттықтаймын! Бүгінде суретшілерге сұраныс жоғары – жылына 15-тен аса жаңа көрме өнер сахнасының өрлеуін көрсетеді!",
  
      "sceneEndDesigner_description": "Сенің туындыларың цифрлық кеңістікті де, нақты әлемді де көркейте түседі. Әлемдік дизайн индустриясы жылына 6–7% өсуде, ал Қазақстанда цифрлық трансформация дизайнерлерге деген сұранысты арттырады.",
      "sceneEndDesigner_dialog": "Тамаша таңдау! Дизайнерлер 2 млн теңгеге дейін табыс табады – олардың креативі компаниялардың келбетін өзгертіп жатыр!",
  
      "sceneEndWriter_description": "Сөз – ықпал етудің қуатты құралы. Онлайн-блогинг пен өзіндік баспаның арқасында жазушылар кең аудиторияға қол жеткізуде, ал Қазақстандағы цифрлық жарияланымдар саны 20%-ға өсіп отыр.",
      "sceneEndWriter_dialog": "Керемет! Жазушылар халыққа шабыт беріп, шығармалары мыңдаған оқырманның жүрегіне жетеді!",
  
      "sceneEndMusician_description": "Музыка – сенің дыбыс әлеміндегі даусың. Ғаламдық музыка нарығы миллиардтаған доллармен бағаланады, ал Қазақстанда музыкалық фестивальдер саны мен стримингтік тыңдалымдар 30%-ға өсті.",
      "sceneEndMusician_dialog": "Ғажап! Музыканттар адамдарды біріктіреді, стримингтік сервистердің өсуі соның айғағы!",
  
      "sceneEndPhotographer_description": "Сен әлемді объектив арқылы көресің, бірегей сәттерді суретке түсіресің. Әлеуметтік желілердің танымалдығына орай кәсіби фотографтарға сұраныс жылына 25%-ға артуда.",
      "sceneEndPhotographer_dialog": "Тамаша! Фотографтарға деген сұраныс жоғары – визуал контентке деген қажеттілік статистикада дәлелденген!",
  
      "sceneEndProgrammer_description": "Код, алгоритмдер мен инновациялар – сенің тіршілік ортаң. Қазақстанда бағдарламашылардың жалақысы жыл сайын 7–10%-ға өсуде, тәжірибелі мамандар 1 млн теңгеден артық табады.",
      "sceneEndProgrammer_dialog": "Таңдауың тамаша! Бағдарламашылар болашақты қалыптастырады – олардың жалақысы 1,2 млн теңгеге және одан жоғары көтерілуі мүмкін!",
  
      "sceneEndDataScientist_description": "Сен үлкен көлемдегі деректерді талдап, үрдістерді анықтайсың, бұл бизнестің дұрыс шешім қабылдауына ықпал етеді. Data Scientist-ке ғаламдық сұраныс жылына 30%-ға дейін артуда.",
      "sceneEndDataScientist_dialog": "Ерекше әсерлі! Data Scientist – деректердің нағыз алхимигі, сұранысы жыл сайын 30%-ға дейін өсуде!",
  
      "sceneEndWebDeveloper_description": "Сен интернетті ыңғайлы ету үшін веб-сайттар мен қосымшалар жасайсың. Қазақстанда бизнесті цифрландыру веб-әзірлеушілерге арналған бос орындарды арттырып, бастапқы жалақысы 700 мың теңгеден басталады.",
      "sceneEndWebDeveloper_dialog": "Тамаша! Web-әзірлеушілер – цифрландыру дәуірінде сұранысқа ие виртуалды кеңістік сәулетшілері!",
  
      "sceneEndNetworkEngineer_description": "Сен байланыс тұрақтылығын қамтамасыз етіп, серверлер мен маршрутизаторларды баптайсың. Қазақстанда телекоммуникация саласы жаңарып, желі инженерлеріне деген сұраныс пен жалақы инфрақұрылыммен бірге өсуде.",
      "sceneEndNetworkEngineer_dialog": "Ғажап! Желі инженерлері – таптырмайтын мамандар, себебі инфрақұрылым жыл сайын жаңартылып отырады!",
  
      "sceneEndGameDeveloper_description": "Сен виртуалды әлемдер мен кейіпкерлерді жасап, идеяларды бейне ойындарда жүзеге асырасың. Әлемдік ойын индустриясы жылына 20%-ға өсуде, ал Қазақстанда алғашқы студиялар талантты әзірлеушілерге мүмкіндік беруде.",
      "sceneEndGameDeveloper_dialog": "Тамаша! Ойын әзірлеушілер қуаныш сыйлайды, ойын нарығы жылына 20%-ға өсіп келеді!",
  
      "sceneEndTeacher_description": "Сен жаңа буынды оқытып, шабыттандырасың. Қазақстанда мұғалімдердің жалақысы 150 мың теңгеден басталады, ал білім беру реформалары олардың сұранысын 10–15%-ға арттырады.",
      "sceneEndTeacher_dialog": "Тамаша! Мұғалімдер – жол көрсетушілер, сапалы білім әрқашан маңызды!",
  
      "sceneEndPsychologist_description": "Сен адамдарға ішкі қайшылықтарын шешіп, үйлесім табуға көмектесесің. Әлемдік деңгейде психологтарға сұраныс өсуде, ал Қазақстанда жеке практика саны артуда, мамандарға мүмкіндіктер көбейіп келеді.",
      "sceneEndPsychologist_dialog": "Керемет! Психологтар қоғамның менталдық саулығында негізгі рөл атқарады!",
  
      "sceneEndHRManager_description": "Сен таланттарды басқарып, тиімді командалар құрсың. Қазақстандағы ірі компанияларда HR-менеджерлерге сұраныс жылына 15%-ға өсіп, персоналды кәсіби басқаруға жол ашады.",
      "sceneEndHRManager_dialog": "Тамаша! HR-менеджерлер – табыстың кілті, өйткені дұрыс кадрлық іріктеу тұрақты өсуге әкеледі!",
  
      "sceneEndJournalist_description": "Сен әрдайым оқиғалардың ортасындасың, цифрлық платформалар үшін сапалы контент жасайсың. Қазақстандағы онлайн-БАҚ-тың өсуі журналистерге сұранысты арттыруда, онда тәжірибе мен кәсібилік жоғары бағаланады.",
      "sceneEndJournalist_dialog": "Керемет! Журналистер – ақиқаттың жаршылары, цифрлық дәуір оларға жаңа мүмкіндіктер сыйлайды!",
  
      "sceneEndCounselor_description": "Сен адамдарды бағыттап, дұрыс шешім қабылдауға көмектесесің. Қазақстанда кеңесшілерге сұраныс жыл сайын 10%-ға өсуде – бизнес пен тұлғалық даму салаларында бірдей қажет.",
      "sceneEndCounselor_dialog": "Тамаша! Кеңесшілер үміт сыйлап, жаңа мүмкіндіктер ашуға жәрдемдеседі!",
  
      "sceneEndAccountant_description": "Сен теңгерімді ұстап, қаржы ағындарын басқарасың. Қазақстанда бухгалтерлер сұранысқа ие: олардың жалақысы 150 мың теңгеден басталады, ал бизнес өскен сайын тұрақты қажеттілік қалады.",
      "sceneEndAccountant_dialog": "Ғажап! Бухгалтерлер – қаржының тірегі, себебі есепті сауатты жүргізу – табыстың кепілі!",
  
      "sceneEndEconomist_description": "Сен экономикалық үрдістерді талдап, қаржылық стратегияларға ықпал етесің. Экономистер Қазақстанда мемлекеттің де, жекеменшік сектордың да қажеттілігіне ие болып, ел экономикасының өсуіне үлес қосады.",
      "sceneEndEconomist_dialog": "Тамаша таңдау! Экономистер – елді ілгерілететін стратегтер!",
  
      "sceneEndResearcher_description": "Сен үнемі жаңа білім іздеп, зерттеулер жүргізесің, бұл жаңа көкжиектерді ашады. Қазақстанда университеттер мен ғылыми-зерттеу институттары жобаларды белсенді дамытып, талантты зерттеушілерді қажет етеді.",
      "sceneEndResearcher_dialog": "Керемет! Зерттеушілер ғылымның шекарасын кеңейтіп, әлемді өзгертетін жаңалықтар ашады!",
  
      "sceneEndMathematician_description": "Сенің әлемің – теңдеулер мен формулалар, онда логика хаостан тәртіп көруге көмектеседі. Математиктер IT мен қаржы секторларында сұранысқа ие, ал Қазақстанда олардың біліктілігі жоғары бағаланады.",
      "sceneEndMathematician_dialog": "Тамаша! Математиктер күрделі міндеттерді шешіп, процестерді оңтайландырады!",
  
      "sceneEndFinancialAnalyst_description": "Сен инвестициялық мүмкіндіктер мен тәуекелдерді саралап, компаниялардың дұрыс шешім қабылдауына көмектесесің. Қазақстанда қаржы талдаушылары жоғары сұраныста, олардың жалақысы өсіп келе жатқан қаржы секторында 1,7 млн теңгеге жетуі мүмкін.",
      "sceneEndFinancialAnalyst_dialog": "Керемет! Қаржы талдаушылары табысты инвестиция мен өркендеуге жол ашады!"
    }
  }
  