{
  "auth": {
    "welcome": "Добро пожаловать в Центр профориентации",
    "name": "Как тебя зовут?",
    "age": "Сколько тебе лет?",
    "start": "Начать путешествие",
    "logout": "Выйти"
  },
  "result": {
    "congratulations": "Поздравляем, {{name}}!",
    "yourProfession": "Твоя профессия",
    "download": "Сохранить результат",
    "share": "Поделиться",
    "startOver": "Пройти заново"
  },
  "home": {
    "hello": "Привет, {{name}}!",
    "startTest": "Начать тест",
    "viewResults": "Посмотреть результаты"
  },
  "test": {
    "question": "Вопрос {{current}} из {{total}}",
    "next": "Далее",
    "previous": "Назад",
    "finish": "Завершить тест"
  },
  "profession": {
    "SceneEndArtist": "Художник",
    "SceneEndDesigner": "Дизайнер",
    "SceneEndWriter": "Писатель",
    "SceneEndMusician": "Музыкант",
    "SceneEndPhotographer": "Фотограф",
    "SceneEndProgrammer": "Программист",
    "SceneEndDataScientist": "Специалист по данным",
    "SceneEndWebDeveloper": "Веб-разработчик",
    "SceneEndNetworkEngineer": "Сетевой инженер",
    "SceneEndGameDeveloper": "Разработчик игр",
    "SceneEndTeacher": "Учитель",
    "SceneEndPsychologist": "Психолог",
    "SceneEndHRManager": "HR-менеджер",
    "SceneEndJournalist": "Журналист",
    "SceneEndCounselor": "Консультант",
    "SceneEndAccountant": "Бухгалтер",
    "SceneEndEconomist": "Экономист",
    "SceneEndResearcher": "Исследователь",
    "SceneEndMathematician": "Математик",
    "SceneEndFinancialAnalyst": "Финансовый аналитик"
  },
  "scenes": {
    "sceneEntrance_description": "Ты входишь в светлое фойе Центра профориентации. Студенты суетятся, но консультант Айдос замечает тебя и улыбается.",
    "sceneEntrance_dialog": "Айдос: «Приветствую! Готов(а) узнать, к чему у тебя склонность? Тогда пройдём небольшой опрос!»",
    "sceneEntrance_choiceStart": "Начать тест",
    "sceneQ1_description": "Ты заходишь в первую секцию, где перед тобой разложены различные предметы для творчества и техники. Рядом стоит Гульмира, ведущая мастер-класс.",
    "sceneQ1_dialog": "Гульмира: «Как тебе нравится проводить свободное время? В чём чувствуешь себя свободнее?»",
    "sceneQ1_choiceCreative": "Обожаю рисовать, сочинять музыку или любые другие творческие занятия",
    "sceneQ1_choiceTech": "Предпочитаю разбираться в технике, гаджетах или писать код",
    "sceneQ1_choiceSocial": "Люблю общаться, помогать людям и быть в гуще событий",
    "sceneQ2_description": "Следующая секция оформлена более серьёзно. На стенах висят научные постеры и проекты студентов. Тебя приветствует Мирас.",
    "sceneQ2_dialog": "Мирас: «Представь, что тебе дали задачу: как ты будешь искать решение?»",
    "sceneQ2_choiceCreative": "Сначала вдохновлюсь, возможно попробую нестандартный ход",
    "sceneQ2_choiceTech": "Составлю план работы, применю технологии или программирование",
    "sceneQ2_choiceAnalytical": "Систематизирую данные, проведу анализ, проверю гипотезы",
    "sceneQ3_description": "Теперь ты проходишь через коридор, где студенты собираются группами. К тебе подходит Сания, координатор волонтёров.",
    "sceneQ3_dialog": "Сания: «У нас есть возможность разработать интересный общественный проект. Какая твоя первая мысль?»",
    "sceneQ3_choiceTech": "Создать мобильное приложение или сайт для координации",
    "sceneQ3_choiceSocial": "Собрать людей, провести обсуждение и распределить роли",
    "sceneQ3_choiceAnalytical": "Проанализировать ресурсы и риски, подсчитать бюджет",
    "sceneQ4_description": "Следующая комната похожа на студию. Звучит музыка, повсюду мольберты и арт-объекты. Тебя встречает Жанар.",
    "sceneQ4_dialog": "Жанар: «Нужно придумать концепт нового фестиваля. Чем займёшься?»",
    "sceneQ4_choiceCreative": "Сразу представлю яркий образ и начну разрабатывать визуальную тему",
    "sceneQ4_choiceTech": "Организую онлайн-платформу и техническое оснащение",
    "sceneQ4_choiceSocial": "Созвонюсь со всеми, найду спонсоров и партнёров для фестиваля",
    "sceneQ5_description": "Далее ты попадаешь в лабораторию. Экран монитора пестрит графиками и формулами. Руководит процессом Алихан.",
    "sceneQ5_dialog": "Алихан: «У нас тут экспериментальные данные, но нужно быстро сделать вывод. Как поступишь?»",
    "sceneQ5_choiceSocial": "Позову коллег, обсудим результаты вместе",
    "sceneQ5_choiceAnalytical": "Сам(а) подсчитаю данные, составлю отчёт и проверю достоверность",
    "sceneQ5_choiceCreative": "Предложу креативный способ визуализации и интерпретации данных",
    "sceneQ6_description": "Теперь ты перемещаешься в IT-лабораторию. Техник по имени Нурбол готов показать тебе новую платформу.",
    "sceneQ6_dialog": "Нурбол: «Можно разработать что-то уникальное, но нужен твой подход. Что будешь делать?»",
    "sceneQ6_choiceTech": "Займусь программированием, сделаю прототип",
    "sceneQ6_choiceSocial": "Постараюсь наладить коллаборацию, вовлечь экспертов и пользователей",
    "sceneQ6_choiceAnalytical": "Соберу требования, тщательно изучу спецификации и просчитаю возможности",
    "sceneQ7_description": "В заключительной секции тебя ждёт куратор по имени Гаухар. Она подводит итог собранной информации о твоих интересах.",
    "sceneQ7_dialog": "Гаухар: «Осталось задать лишь один вопрос, чтобы мы окончательно определили твои сильные стороны. Скажи, какой подход тебе ближе всего в командной работе?»",
    "sceneQ7_choiceCreative": "Вдохновлять идеями, генерировать новые концепты",
    "sceneQ7_choiceTech": "Создавать техническую часть и автоматизировать процессы",
    "sceneQ7_choiceAnalytical": "Изучать детали, анализировать и планировать пошагово",
    "sceneEndArtist_description": "Ты попадаешь в мир искусства, где число выставок и галерей в Казахстане растёт на 10–15% ежегодно, а онлайн-платформы открывают новые возможности для творчества.",
    "sceneEndArtist_dialog": "Поздравляю! Художники сегодня востребованы – более 15 новых выставок в год подтверждают рост арт-сцены!",
    "sceneEndDesigner_description": "Твои работы преображают как цифровое пространство, так и реальный мир. Мировая индустрия дизайна растёт на 6–7% ежегодно, а в Казахстане цифровая трансформация поднимает спрос на дизайнеров.",
    "sceneEndDesigner_dialog": "Отличный выбор! Дизайнеры получают до 2 млн тенге – их креатив меняет облик компаний!",
    "sceneEndWriter_description": "Слова становятся мощным инструментом влияния. Благодаря онлайн-блоггингу и самиздату писатели охватывают широкую аудиторию, а количество цифровых публикаций в Казахстане растёт на 20%.",
    "sceneEndWriter_dialog": "Потрясающе! Писатели вдохновляют массы – их произведения находят отклик у тысяч читателей!",
    "sceneEndMusician_description": "Музыка – твой голос в мире звуков. Глобальный музыкальный рынок оценивается в миллиарды долларов, а в Казахстане количество музыкальных фестивалей и стриминговых прослушиваний выросло на 30%.",
    "sceneEndMusician_dialog": "Здорово! Музыканты объединяют людей, и рост стриминговых сервисов говорит сам за себя!",
    "sceneEndPhotographer_description": "Ты видишь мир через объектив, запечатлевая уникальные мгновения. Спрос на профессиональных фотографов растёт на 25% ежегодно благодаря популярности социальных сетей.",
    "sceneEndPhotographer_dialog": "Великолепно! Фотографы востребованы – рост спроса на визуальный контент подтвержден статистикой!",
    "sceneEndProgrammer_description": "Код, алгоритмы и инновации – это твоя стихия. Зарплаты программистов в Казахстане растут на 7–10% ежегодно, и опытные специалисты могут зарабатывать свыше 1 млн тенге.",
    "sceneEndProgrammer_dialog": "Отличный выбор! Программисты формируют будущее – их зарплаты достигают 1,2 млн тенге и выше!",
    "sceneEndDataScientist_description": "Ты анализируешь огромные массивы данных, находя закономерности, что помогает бизнесу принимать решения. Глобальный спрос на Data Scientist растёт до 30% в год.",
    "sceneEndDataScientist_dialog": "Впечатляет! Data Scientist – настоящий алхимик данных, востребованный с ростом до 30% ежегодно!",
    "sceneEndWebDeveloper_description": "Ты создаёшь веб-сайты и приложения, делая интернет удобнее. В Казахстане цифровизация бизнеса увеличивает число вакансий для веб-разработчиков, со стартовыми зарплатами от 700 тыс. тенге.",
    "sceneEndWebDeveloper_dialog": "Прекрасно! Web-разработчики – архитекторы виртуального пространства, востребованные в эпоху цифровизации!",
    "sceneEndNetworkEngineer_description": "Ты обеспечиваешь стабильность связи, настраивая сервера и маршрутизаторы. Модернизация телекоммуникаций в Казахстане стимулирует спрос на сетевых инженеров, зарплаты которых растут вместе с инфраструктурой.",
    "sceneEndNetworkEngineer_dialog": "Здорово! Сетевые инженеры – незаменимые специалисты, ведь инфраструктура обновляется ежегодно!",
    "sceneEndGameDeveloper_description": "Ты создаёшь виртуальные миры и героев, воплощая идеи в видеоиграх. Мировая игровая индустрия растёт на 20% в год, а в Казахстане появляются первые студии, дающие шанс талантливым разработчикам.",
    "sceneEndGameDeveloper_dialog": "Чудесно! Разработчики игр дарят радость, ведь рынок игр растёт на 20% ежегодно!",
    "sceneEndTeacher_description": "Ты обучаешь и вдохновляешь новые поколения. В Казахстане зарплаты учителей начинаются от 150 тыс. тенге, а реформы в образовании увеличивают их востребованность на 10–15%.",
    "sceneEndTeacher_dialog": "Прекрасно! Учителя – путеводные звезды, ведь качественное образование всегда в цене!",
    "sceneEndPsychologist_description": "Ты помогаешь людям находить гармонию и решать внутренние конфликты. Глобальный спрос на психологов растёт, а в Казахстане число частных практик увеличивается, расширяя возможности для специалистов.",
    "sceneEndPsychologist_dialog": "Замечательно! Психологи сегодня – ключевые фигуры ментального здоровья общества!",
    "sceneEndHRManager_description": "Ты управляешь талантами и создаёшь эффективные команды. В крупных компаниях Казахстана спрос на HR-менеджеров растёт на 15% ежегодно, обеспечивая профессиональное управление персоналом.",
    "sceneEndHRManager_dialog": "Отлично! HR-менеджеры – ключ к успеху, ведь правильный подбор кадров приносит стабильный рост!",
    "sceneEndJournalist_description": "Ты всегда в центре событий, создавая качественный контент для цифровых платформ. Рост онлайн-СМИ в Казахстане стимулирует спрос на журналистов, где опыт и профессионализм особенно ценятся.",
    "sceneEndJournalist_dialog": "Замечательно! Журналисты – носители правды, и цифровая эра открывает им новые горизонты!",
    "sceneEndCounselor_description": "Ты направляешь людей, помогая им делать правильный выбор. В Казахстане спрос на консультантов растёт на 10% ежегодно, как в бизнесе, так и в личностном развитии.",
    "sceneEndCounselor_dialog": "Прекрасно! Консультанты дают надежду и помогают открыть новые перспективы!",
    "sceneEndAccountant_description": "Ты держишь баланс и управляешь финансовыми потоками. В Казахстане бухгалтеры востребованы: их зарплаты стартуют от 150 тыс. тенге, а спрос стабилен благодаря развитию бизнеса.",
    "sceneEndAccountant_dialog": "Здорово! Бухгалтеры – опора финансов, ведь грамотное ведение учёта гарантирует успех!",
    "sceneEndEconomist_description": "Ты анализируешь экономические тренды и влияешь на финансовые стратегии. Экономисты востребованы как в государственном, так и в частном секторе Казахстана, способствуя росту экономики страны.",
    "sceneEndEconomist_dialog": "Прекрасный выбор! Экономисты – стратеги, помогающие двигаться вперёд!",
    "sceneEndResearcher_description": "Ты постоянно ищешь новые знания и проводишь исследования, которые открывают новые горизонты. В Казахстане университеты и НИИ активно развивают проекты, требуя талантливых исследователей.",
    "sceneEndResearcher_dialog": "Великолепно! Исследователи расширяют границы науки и делают открытия, меняющие мир!",
    "sceneEndMathematician_description": "Твой мир – уравнения и формулы, где логика помогает видеть порядок в хаосе. Математики востребованы в IT и финансовых секторах, а в Казахстане их навыки ценятся особенно высоко.",
    "sceneEndMathematician_dialog": "Отлично! Математики – ключ к сложным задачам и оптимизации процессов!",
    "sceneEndFinancialAnalyst_description": "Ты оцениваешь инвестиционные возможности и риски, помогая компаниям принимать взвешенные решения. В Казахстане финансовые аналитики востребованы, а их зарплаты могут достигать 1,7 млн тенге в условиях растущего финансового сектора.",
    "sceneEndFinancialAnalyst_dialog": "Замечательно! Финансовые аналитики открывают путь к успешным инвестициям и процветанию!"
  }
}